; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-27-25)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 - object)
(:init
(at-robby robot1 room9)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room22)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room27)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room1)
(at ball2 room4)
(at ball3 room22)
(at ball4 room24)
(at ball5 room11)
(at ball6 room19)
(at ball7 room12)
(at ball8 room20)
(at ball9 room10)
(at ball10 room22)
(at ball11 room15)
(at ball12 room1)
(at ball13 room19)
(at ball14 room23)
(at ball15 room15)
(at ball16 room7)
(at ball17 room18)
(at ball18 room24)
(at ball19 room21)
(at ball20 room19)
(at ball21 room23)
(at ball22 room25)
(at ball23 room12)
(at ball24 room13)
(at ball25 room11)
)
(:goal
(and
(at ball1 room6)
(at ball2 room27)
(at ball3 room3)
(at ball4 room15)
(at ball5 room21)
(at ball6 room2)
(at ball7 room15)
(at ball8 room25)
(at ball9 room24)
(at ball10 room11)
(at ball11 room8)
(at ball12 room16)
(at ball13 room22)
(at ball14 room27)
(at ball15 room25)
(at ball16 room16)
(at ball17 room15)
(at ball18 room25)
(at ball19 room8)
(at ball20 room11)
(at ball21 room13)
(at ball22 room14)
(at ball23 room1)
(at ball24 room10)
(at ball25 room8)
)
)
)

; plan
1. (pick robot2 ball3 room22 lgripper2)
   deleted: (at ball3 room22) (free robot2 lgripper2)
   added: (carry robot2 ball3 lgripper2)
   goals met: 0 of 25
2. (pick robot2 ball10 room22 rgripper2)
   deleted: (at ball10 room22) (free robot2 rgripper2)
   added: (carry robot2 ball10 rgripper2)
   goals met: 0 of 25
3. (move robot1 room9 room8)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room8)
   goals met: 0 of 25
4. (move robot3 room27 room7)
   deleted: (at-robby robot3 room27)
   added: (at-robby robot3 room7)
   goals met: 0 of 25
5. (move robot2 room22 room3)
   deleted: (at-robby robot2 room22)
   added: (at-robby robot2 room3)
   goals met: 0 of 25
6. (pick robot3 ball16 room7 lgripper3)
   deleted: (at ball16 room7) (free robot3 lgripper3)
   added: (carry robot3 ball16 lgripper3)
   goals met: 0 of 25
7. (move robot1 room8 room4)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room4)
   goals met: 0 of 25
8. (drop robot2 ball3 room3 lgripper2)
   deleted: (carry robot2 ball3 lgripper2)
   added: (at ball3 room3) (free robot2 lgripper2)
   goals met: 1 of 25
9. (move robot3 room7 room16)
   deleted: (at-robby robot3 room7)
   added: (at-robby robot3 room16)
   goals met: 1 of 25
10. (pick robot1 ball2 room4 lgripper1)
   deleted: (at ball2 room4) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 1 of 25
11. (move robot2 room3 room11)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room11)
   goals met: 1 of 25
12. (drop robot3 ball16 room16 lgripper3)
   deleted: (carry robot3 ball16 lgripper3)
   added: (at ball16 room16) (free robot3 lgripper3)
   goals met: 2 of 25
13. (move robot1 room4 room27)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room27)
   goals met: 2 of 25
14. (drop robot2 ball10 room11 rgripper2)
   deleted: (carry robot2 ball10 rgripper2)
   added: (at ball10 room11) (free robot2 rgripper2)
   goals met: 3 of 25
15. (move robot3 room16 room8)
   deleted: (at-robby robot3 room16)
   added: (at-robby robot3 room8)
   goals met: 3 of 25
16. (drop robot1 ball2 room27 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room27) (free robot1 lgripper1)
   goals met: 4 of 25
17. (pick robot2 ball5 room11 lgripper2)
   deleted: (at ball5 room11) (free robot2 lgripper2)
   added: (carry robot2 ball5 lgripper2)
   goals met: 4 of 25
18. (move robot2 room11 room21)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room21)
   goals met: 4 of 25
19. (move robot1 room27 room8)
   deleted: (at-robby robot1 room27)
   added: (at-robby robot1 room8)
   goals met: 4 of 25
20. (move robot3 room8 room25)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room25)
   goals met: 4 of 25
21. (drop robot2 ball5 room21 lgripper2)
   deleted: (carry robot2 ball5 lgripper2)
   added: (at ball5 room21) (free robot2 lgripper2)
   goals met: 5 of 25
22. (pick robot2 ball19 room21 rgripper2)
   deleted: (at ball19 room21) (free robot2 rgripper2)
   added: (carry robot2 ball19 rgripper2)
   goals met: 5 of 25
23. (pick robot3 ball22 room25 lgripper3)
   deleted: (at ball22 room25) (free robot3 lgripper3)
   added: (carry robot3 ball22 lgripper3)
   goals met: 5 of 25
24. (move robot1 room8 room24)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room24)
   goals met: 5 of 25
25. (move robot2 room21 room8)
   deleted: (at-robby robot2 room21)
   added: (at-robby robot2 room8)
   goals met: 5 of 25
26. (move robot3 room25 room14)
   deleted: (at-robby robot3 room25)
   added: (at-robby robot3 room14)
   goals met: 5 of 25
27. (pick robot1 ball4 room24 lgripper1)
   deleted: (at ball4 room24) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 5 of 25
28. (drop robot2 ball19 room8 rgripper2)
   deleted: (carry robot2 ball19 rgripper2)
   added: (at ball19 room8) (free robot2 rgripper2)
   goals met: 6 of 25
29. (drop robot3 ball22 room14 lgripper3)
   deleted: (carry robot3 ball22 lgripper3)
   added: (at ball22 room14) (free robot3 lgripper3)
   goals met: 7 of 25
30. (move robot1 room24 room18)
   deleted: (at-robby robot1 room24)
   added: (at-robby robot1 room18)
   goals met: 7 of 25
31. (move robot3 room14 room8)
   deleted: (at-robby robot3 room14)
   added: (at-robby robot3 room8)
   goals met: 7 of 25
32. (pick robot1 ball17 room18 rgripper1)
   deleted: (at ball17 room18) (free robot1 rgripper1)
   added: (carry robot1 ball17 rgripper1)
   goals met: 7 of 25
33. (move robot2 room8 room24)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room24)
   goals met: 7 of 25
34. (move robot3 room8 room6)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room6)
   goals met: 7 of 25
35. (move robot1 room18 room15)
   deleted: (at-robby robot1 room18)
   added: (at-robby robot1 room15)
   goals met: 7 of 25
36. (pick robot2 ball18 room24 lgripper2)
   deleted: (at ball18 room24) (free robot2 lgripper2)
   added: (carry robot2 ball18 lgripper2)
   goals met: 7 of 25
37. (drop robot1 ball4 room15 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room15) (free robot1 lgripper1)
   goals met: 8 of 25
38. (drop robot1 ball17 room15 rgripper1)
   deleted: (carry robot1 ball17 rgripper1)
   added: (at ball17 room15) (free robot1 rgripper1)
   goals met: 9 of 25
39. (move robot2 room24 room25)
   deleted: (at-robby robot2 room24)
   added: (at-robby robot2 room25)
   goals met: 9 of 25
40. (move robot3 room6 room23)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room23)
   goals met: 9 of 25
41. (drop robot2 ball18 room25 lgripper2)
   deleted: (carry robot2 ball18 lgripper2)
   added: (at ball18 room25) (free robot2 lgripper2)
   goals met: 10 of 25
42. (pick robot1 ball15 room15 rgripper1)
   deleted: (at ball15 room15) (free robot1 rgripper1)
   added: (carry robot1 ball15 rgripper1)
   goals met: 10 of 25
43. (pick robot3 ball21 room23 lgripper3)
   deleted: (at ball21 room23) (free robot3 lgripper3)
   added: (carry robot3 ball21 lgripper3)
   goals met: 10 of 25
44. (pick robot3 ball14 room23 rgripper3)
   deleted: (at ball14 room23) (free robot3 rgripper3)
   added: (carry robot3 ball14 rgripper3)
   goals met: 10 of 25
45. (move robot1 room15 room25)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room25)
   goals met: 10 of 25
46. (move robot3 room23 room13)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room13)
   goals met: 10 of 25
47. (move robot2 room25 room20)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room20)
   goals met: 10 of 25
48. (drop robot1 ball15 room25 rgripper1)
   deleted: (carry robot1 ball15 rgripper1)
   added: (at ball15 room25) (free robot1 rgripper1)
   goals met: 11 of 25
49. (pick robot2 ball8 room20 lgripper2)
   deleted: (at ball8 room20) (free robot2 lgripper2)
   added: (carry robot2 ball8 lgripper2)
   goals met: 11 of 25
50. (drop robot3 ball21 room13 lgripper3)
   deleted: (carry robot3 ball21 lgripper3)
   added: (at ball21 room13) (free robot3 lgripper3)
   goals met: 12 of 25
51. (move robot2 room20 room25)
   deleted: (at-robby robot2 room20)
   added: (at-robby robot2 room25)
   goals met: 12 of 25
52. (move robot3 room13 room27)
   deleted: (at-robby robot3 room13)
   added: (at-robby robot3 room27)
   goals met: 12 of 25
53. (move robot1 room25 room24)
   deleted: (at-robby robot1 room25)
   added: (at-robby robot1 room24)
   goals met: 12 of 25
54. (drop robot2 ball8 room25 lgripper2)
   deleted: (carry robot2 ball8 lgripper2)
   added: (at ball8 room25) (free robot2 lgripper2)
   goals met: 13 of 25
55. (drop robot3 ball14 room27 rgripper3)
   deleted: (carry robot3 ball14 rgripper3)
   added: (at ball14 room27) (free robot3 rgripper3)
   goals met: 14 of 25
56. (move robot1 room24 room22)
   deleted: (at-robby robot1 room24)
   added: (at-robby robot1 room22)
   goals met: 14 of 25
57. (move robot3 room27 room8)
   deleted: (at-robby robot3 room27)
   added: (at-robby robot3 room8)
   goals met: 14 of 25
58. (move robot2 room25 room13)
   deleted: (at-robby robot2 room25)
   added: (at-robby robot2 room13)
   goals met: 14 of 25
59. (move robot1 room22 room19)
   deleted: (at-robby robot1 room22)
   added: (at-robby robot1 room19)
   goals met: 14 of 25
60. (pick robot2 ball24 room13 lgripper2)
   deleted: (at ball24 room13) (free robot2 lgripper2)
   added: (carry robot2 ball24 lgripper2)
   goals met: 14 of 25
61. (pick robot1 ball6 room19 lgripper1)
   deleted: (at ball6 room19) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 14 of 25
62. (pick robot1 ball13 room19 rgripper1)
   deleted: (at ball13 room19) (free robot1 rgripper1)
   added: (carry robot1 ball13 rgripper1)
   goals met: 14 of 25
63. (move robot3 room8 room6)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room6)
   goals met: 14 of 25
64. (move robot2 room13 room10)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room10)
   goals met: 14 of 25
65. (move robot1 room19 room22)
   deleted: (at-robby robot1 room19)
   added: (at-robby robot1 room22)
   goals met: 14 of 25
66. (move robot3 room6 room19)
   deleted: (at-robby robot3 room6)
   added: (at-robby robot3 room19)
   goals met: 14 of 25
67. (drop robot2 ball24 room10 lgripper2)
   deleted: (carry robot2 ball24 lgripper2)
   added: (at ball24 room10) (free robot2 lgripper2)
   goals met: 15 of 25
68. (drop robot1 ball13 room22 rgripper1)
   deleted: (carry robot1 ball13 rgripper1)
   added: (at ball13 room22) (free robot1 rgripper1)
   goals met: 16 of 25
69. (pick robot2 ball9 room10 rgripper2)
   deleted: (at ball9 room10) (free robot2 rgripper2)
   added: (carry robot2 ball9 rgripper2)
   goals met: 16 of 25
70. (pick robot3 ball20 room19 lgripper3)
   deleted: (at ball20 room19) (free robot3 lgripper3)
   added: (carry robot3 ball20 lgripper3)
   goals met: 16 of 25
71. (move robot2 room10 room24)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room24)
   goals met: 16 of 25
72. (move robot1 room22 room2)
   deleted: (at-robby robot1 room22)
   added: (at-robby robot1 room2)
   goals met: 16 of 25
73. (move robot3 room19 room16)
   deleted: (at-robby robot3 room19)
   added: (at-robby robot3 room16)
   goals met: 16 of 25
74. (drop robot2 ball9 room24 rgripper2)
   deleted: (carry robot2 ball9 rgripper2)
   added: (at ball9 room24) (free robot2 rgripper2)
   goals met: 17 of 25
75. (drop robot1 ball6 room2 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room2) (free robot1 lgripper1)
   goals met: 18 of 25
76. (move robot3 room16 room11)
   deleted: (at-robby robot3 room16)
   added: (at-robby robot3 room11)
   goals met: 18 of 25
77. (drop robot3 ball20 room11 lgripper3)
   deleted: (carry robot3 ball20 lgripper3)
   added: (at ball20 room11) (free robot3 lgripper3)
   goals met: 19 of 25
78. (pick robot3 ball25 room11 rgripper3)
   deleted: (at ball25 room11) (free robot3 rgripper3)
   added: (carry robot3 ball25 rgripper3)
   goals met: 19 of 25
79. (move robot1 room2 room8)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room8)
   goals met: 19 of 25
80. (move robot2 room24 room8)
   deleted: (at-robby robot2 room24)
   added: (at-robby robot2 room8)
   goals met: 19 of 25
81. (move robot3 room11 room8)
   deleted: (at-robby robot3 room11)
   added: (at-robby robot3 room8)
   goals met: 19 of 25
82. (move robot1 room8 room1)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room1)
   goals met: 19 of 25
83. (move robot2 room8 room15)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room15)
   goals met: 19 of 25
84. (drop robot3 ball25 room8 rgripper3)
   deleted: (carry robot3 ball25 rgripper3)
   added: (at ball25 room8) (free robot3 rgripper3)
   goals met: 20 of 25
85. (pick robot1 ball12 room1 lgripper1)
   deleted: (at ball12 room1) (free robot1 lgripper1)
   added: (carry robot1 ball12 lgripper1)
   goals met: 20 of 25
86. (pick robot1 ball1 room1 rgripper1)
   deleted: (at ball1 room1) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 20 of 25
87. (pick robot2 ball11 room15 lgripper2)
   deleted: (at ball11 room15) (free robot2 lgripper2)
   added: (carry robot2 ball11 lgripper2)
   goals met: 20 of 25
88. (move robot3 room8 room15)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room15)
   goals met: 20 of 25
89. (move robot1 room1 room6)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room6)
   goals met: 20 of 25
90. (move robot2 room15 room8)
   deleted: (at-robby robot2 room15)
   added: (at-robby robot2 room8)
   goals met: 20 of 25
91. (drop robot1 ball1 room6 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room6) (free robot1 rgripper1)
   goals met: 21 of 25
92. (drop robot2 ball11 room8 lgripper2)
   deleted: (carry robot2 ball11 lgripper2)
   added: (at ball11 room8) (free robot2 lgripper2)
   goals met: 22 of 25
93. (move robot3 room15 room12)
   deleted: (at-robby robot3 room15)
   added: (at-robby robot3 room12)
   goals met: 22 of 25
94. (move robot1 room6 room16)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room16)
   goals met: 22 of 25
95. (pick robot3 ball7 room12 lgripper3)
   deleted: (at ball7 room12) (free robot3 lgripper3)
   added: (carry robot3 ball7 lgripper3)
   goals met: 22 of 25
96. (pick robot3 ball23 room12 rgripper3)
   deleted: (at ball23 room12) (free robot3 rgripper3)
   added: (carry robot3 ball23 rgripper3)
   goals met: 22 of 25
97. (drop robot1 ball12 room16 lgripper1)
   deleted: (carry robot1 ball12 lgripper1)
   added: (at ball12 room16) (free robot1 lgripper1)
   goals met: 23 of 25
98. (move robot3 room12 room15)
   deleted: (at-robby robot3 room12)
   added: (at-robby robot3 room15)
   goals met: 23 of 25
99. (drop robot3 ball7 room15 lgripper3)
   deleted: (carry robot3 ball7 lgripper3)
   added: (at ball7 room15) (free robot3 lgripper3)
   goals met: 24 of 25
100. (move robot3 room15 room1)
   deleted: (at-robby robot3 room15)
   added: (at-robby robot3 room1)
   goals met: 24 of 25
101. (drop robot3 ball23 room1 rgripper3)
   deleted: (carry robot3 ball23 rgripper3)
   added: (at ball23 room1) (free robot3 rgripper3)
   goals met: 25 of 25
